1Ô∏è‚É£ What is an ETL Pipeline?
An ETL pipeline is a structured process to:

Extract ‚Üí Pull data from one or more sources (files, APIs, databases, streams, etc.).

Transform ‚Üí Clean, validate, reformat, enrich, or aggregate the data into the required form.

Load ‚Üí Push the processed data into a target system (e.g., SQL database, data warehouse, analytics tool).

üìå In Data Engineering, ETL is used to move data from raw sources ‚Üí analytics-ready formats.

2Ô∏è‚É£ Core Components
A. Extract
Sources can be:

Files ‚Üí CSV, Excel, JSON, Parquet

Databases ‚Üí MySQL, PostgreSQL, SQLite

APIs ‚Üí REST, GraphQL

Streaming ‚Üí Kafka, RabbitMQ

Cloud Storage ‚Üí AWS S3, Google Cloud Storage

Python tools for extraction:

pandas.read_csv() / read_excel() / read_json()

requests or httpx for API calls

sqlite3 / SQLAlchemy / psycopg2 for DB queries

boto3 for AWS S3

B. Transform
This is often the heaviest part of ETL.
Common transformations:

Data Cleaning ‚Üí Handle missing values, remove duplicates, fix data types.

Data Enrichment ‚Üí Add calculated fields, merge with reference data.

Data Aggregation ‚Üí Summaries, grouping, rolling averages.

Data Standardization ‚Üí Consistent formats for dates, currencies, casing.

Python tools for transformation:

pandas ‚Üí For tabular data wrangling.

numpy ‚Üí For numeric operations.

pyarrow / fastparquet ‚Üí For efficient file formats.

Business Logic ‚Üí Applying rules from domain knowledge.

C. Load
Targets can be:

Databases ‚Üí MySQL, PostgreSQL, SQLite

Data Warehouses ‚Üí Snowflake, BigQuery, Redshift

Data Lakes ‚Üí S3, HDFS

Files ‚Üí CSV, Parquet, JSON for reporting

Python tools for loading:

pandas.to_sql() (with SQLAlchemy engine)

Database connectors (mysql-connector-python, psycopg2)

boto3 for S3 uploads

to_csv() / to_parquet() for local files

3Ô∏è‚É£ Simple Example ETL in Python

import pandas as pd
import sqlite3
import requests

# === 1. EXTRACT ===
url = "https://api.exchangerate-api.com/v4/latest/USD"
data = requests.get(url).json()
df = pd.DataFrame(data['rates'].items(), columns=['Currency', 'Rate'])

# === 2. TRANSFORM ===
df['Rate'] = df['Rate'].round(2)  # Round to 2 decimal places
df = df.sort_values(by='Rate', ascending=False)

# === 3. LOAD ===
conn = sqlite3.connect('exchange_rates.db')
df.to_sql('rates', conn, if_exists='replace', index=False)
conn.close()
print("ETL Pipeline completed successfully!")
4Ô∏è‚É£ Best Practices for ETL Pipelines
‚úÖ Make it repeatable ‚Äî wrap in functions or classes.
‚úÖ Parameterize ‚Äî avoid hardcoding file paths or credentials.
‚úÖ Log everything ‚Äî so you can debug issues.
‚úÖ Validate data ‚Äî ensure correct schema & no corruption.
‚úÖ Use incremental loads ‚Äî only process new or changed data when possible.
‚úÖ Consider orchestration tools ‚Äî Airflow, Prefect, Kedro for production.

5Ô∏è‚É£ Scaling Up
When your ETL gets bigger:

Batch vs. Streaming ETL

Batch ‚Üí Runs at fixed intervals (daily/hourly).

Streaming ‚Üí Processes data in near real-time (Kafka, Spark Streaming).

Distributed Processing ‚Üí Use Spark or Dask for large datasets.

Data Quality Checks ‚Üí Great Expectations, dbt tests.

In [218]:
import pandas as pd 
import requests
import sqlite3


# === 1. EXTRACT ===

url = "https://api.exchangerate-api.com/v4/latest/USD"
data =requests.get(url).json()

df = pd.DataFrame(data['rates'].items(), columns=['currency', 'rate'])
df.head()

# === 2. TRANSFORM ===
df['rate'] = df['rate'].round(2)
df = df.sort_values(by='rate', ascending=False)
df.head()

# === 3. LOAD ===
conn = sqlite3.connect('exchange_rates.db')
df.to_sql('rates', conn, if_exists='replace', index=False)
conn.close()

print("ETL Pipeline completed successfully!")

ETL Pipeline completed successfully!

project on employee salary analysis
we'll use dataset data.csv in which it  have employee data
first connect with mysql then make a database

In [13]:
import mysql.connector
import pandas as pd 
conn = mysql.connector.connect(
      host='127.0.0.1',
        port=3306,
        user='root',
        password='*Notebook@2025',
        database='employee'
)

cursor = conn.cursor()

In [220]:
cursor.execute("SHOW DATABASES")
for db in cursor:
    print(db[0])

30day_sql_query
amazon_present_absent
basic_sql
case_study
employee
football_matach
information_schema
invoicing
mysql
performance_schema
sql_hr
sql_inventory
sql_invoicing
sql_store
store
sys

In [221]:
df = pd.read_csv("data.csv")
df.head()

      Name  Age       City  Salary
0    David   34  San Diego   79076
1  Charlie   35    Phoenix   76699
2    Quinn   38   New York   93478
3      Eve   32    Phoenix   92233
4     Paul   27    Houston   96396

Step 2 ‚Äì Transform: Clean and Analyze in Pandas

In [222]:
df.drop_duplicates(inplace=True)

In [223]:
# souppose we want see high erners
high_earners = df[df['Salary'] > 80000]
high_earners.head()

    Name  Age       City  Salary
2  Quinn   38   New York   93478
3    Eve   32    Phoenix   92233
4   Paul   27    Houston   96396
7  Grace   47  San Diego   83846
8   Nate   59    Houston   84534

In [224]:
create_table_query= '''CREATE TABLE IF NOT EXISTS emp(
Name VARCHAR(100), Age INT, City VARCHAR(100), Salary DECIMAL(10,2)
) '''
cursor.execute(create_table_query)
conn.commit()

In [225]:
insert_query=''' INSERT INTO emp(Name, Age, City, Salary) VALUES(%s, %s, %s, %s) '''
for _,row in df.iterrows():
    cursor.execute(insert_query, tuple(row))

In [226]:
# Top 5 highest salaries
cursor.execute('SELECT Name, Salary FROM emp ORDER BY Salary DESC LIMIT 5')
cursor.fetchall()

[('Liam', Decimal('118931.00')),
 ('Paul', Decimal('96396.00')),
 ('Steve', Decimal('94769.00')),
 ('Quinn', Decimal('93478.00')),
 ('Eve', Decimal('92233.00'))]

In [227]:
cursor.execute("SELECT DATABASE();")
print(cursor.fetchone())

('employee',)

In [228]:
cursor.execute("SELECT COUNT(*) FROM emp;")
print(cursor.fetchone())

(20,)

In [229]:
cursor.execute("SELECT * FROM emp;")
for row in cursor.fetchall():
    print(row)

('David', 34, 'San Diego', Decimal('79076.00'))
('Charlie', 35, 'Phoenix', Decimal('76699.00'))
('Quinn', 38, 'New York', Decimal('93478.00'))
('Eve', 32, 'Phoenix', Decimal('92233.00'))
('Paul', 27, 'Houston', Decimal('96396.00'))
('Hannah', 58, 'New York', Decimal('59351.00'))
('Nate', 29, 'San Antonio', Decimal('60027.00'))
('Grace', 47, 'San Diego', Decimal('83846.00'))
('Nate', 59, 'Houston', Decimal('84534.00'))
('Quinn', 59, 'San Antonio', Decimal('83279.00'))
('Grace', 39, 'San Antonio', Decimal('79001.00'))
('Ian', 43, 'San Antonio', Decimal('65220.00'))
('Bob', 44, 'San Diego', Decimal('48379.00'))
('Hannah', 56, 'New York', Decimal('84126.00'))
('Paul', 35, 'Houston', Decimal('91438.00'))
('Liam', 32, 'Chicago', Decimal('118931.00'))
('Hannah', 36, 'Los Angeles', Decimal('80513.00'))
('Nate', 29, 'San Antonio', Decimal('89020.00'))
('Olivia', 49, 'San Antonio', Decimal('87224.00'))
('Steve', 38, 'New York', Decimal('94769.00'))

In [230]:
import warnings
warnings.filterwarnings('ignore', message='pandas only supports SQLAlchemy')
query = "SELECT City, AVG(Salary) AS avg_salary FROM emp GROUP BY City"

df_avg = pd.read_sql(query, conn)

df_avg = pd.read_sql(query, conn)
df_avg

          City     avg_salary
0    San Diego   70433.666667
1      Phoenix   84466.000000
2     New York   82931.000000
3      Houston   90789.333333
4  San Antonio   77295.166667
5      Chicago  118931.000000
6  Los Angeles   80513.000000

In [232]:
import warnings
warnings.filterwarnings('ignore', message='pandas only supports SQLAlchemy')

query = """
SELECT City, AVG(Salary) AS highest_avg_sal
FROM emp
GROUP BY City
ORDER BY highest_avg_sal DESC
LIMIT 3;
"""
df_avg = pd.read_sql(query, conn)
df_avg
conn.close()

In [9]:
import pandas as pd
from sqlalchemy import create_engine
from urllib.parse import quote_plus 

# ---- 1. Connection Details ----
host = "127.0.0.1"
port = 3306
user = "root"
password = quote_plus("*Notebook@2025")  # URL-encode special chars
database = "employee"

# SQLAlchemy connection string for MySQL
engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}/{database}")

In [234]:
query = "SELECT city, AVG(salary) AS avg_salary FROM emp GROUP BY city"
df_avg = pd.read_sql(query, engine)
print(df_avg)

Empty DataFrame
Columns: [city, avg_salary]
Index: []

In [235]:
from sqlalchemy import text

with engine.connect() as conn:
    result = conn.execute(text("SELECT * FROM emp"))
    rows = result.fetchall()

print(rows)  # see all rows

[]

Extract ‚Äì Get the dataset (CSV or from an API).

In [2]:
import pandas as pd 

df = pd.read_csv("data.csv")
df.head()

      Name  Age       City  Salary
0    David   34  San Diego   79076
1  Charlie   35    Phoenix   76699
2    Quinn   38   New York   93478
3      Eve   32    Phoenix   92233
4     Paul   27    Houston   96396

Step 2 ‚Äì Transform

In [7]:
# Remove duplicates
df = df.drop_duplicates()

# Remove rows with missing values in important columns
df = df.dropna(subset=['Name', 'Salary'])

# Convert salary to integer if not already
df['Salary'] = df['Salary'].astype(int)

# Add a column for yearly bonus (10% of salary)
df['yearly_bonus'] = df['Salary'] * 0.10

df.head()

      Name  Age       City  Salary  yearly_bonus
0    David   34  San Diego   79076        7907.6
1  Charlie   35    Phoenix   76699        7669.9
2    Quinn   38   New York   93478        9347.8
3      Eve   32    Phoenix   92233        9223.3
4     Paul   27    Houston   96396        9639.6

Step 3 ‚Äì Load into MySQL

In [14]:
import mysql.connector
from urllib.parse import quote_plus 


conn = mysql.connector.connect(
      host='127.0.0.1',
        port=3306,
        user='root',
        password='*Notebook@2025',
        database='employee'
)

cursor = conn.cursor()

In [21]:
# create a table 

create_table_query = '''CREATE TABLE IF NOT EXISTS employees(
            name VARCHAR(255),
            age INT,
            city VARCHAR(255),
            salary INT,
            yearly_bonus FLOAT
) ''' 

cursor.execute(create_table_query)

In [23]:
# Insert data into table

insert_data_q='''INSERT INTO employees(name, age, city, salary, yearly_bonus)
                VALUES(%s, %s, %s, %s, %s )
'''

for _, row in df.iterrows():
    cursor.execute(insert_data_q, tuple(row))

conn.commit()
conn.close()
print("Data successfully loaded into MySQL!")

Data successfully loaded into MySQL!

etl_pipeline_notebook.py (but all inside your Jupyter cell)

In [73]:
import pandas as pd
import mysql.connector
from urllib.parse import quote_plus 


# 1Ô∏è‚É£ EXTRACT: Load CSV into Pandas DataFrame

def extract_data(file_path):
    df = pd.read_csv(file_path)
    return df


# 2Ô∏è‚É£ TRANSFORM: Example transformations

def transform_data(df):
    # Remove duplicate rows
    df = df.drop_duplicates()

    # Remove rows with missing names
    df = df.dropna(subset=['Name','Salary'])

    # Example: Ensure salary is numeric
    df['salary'] = pd.to_numeric(df['Salary'], errors='coerce')

    return df

# 3Ô∏è‚É£ LOAD: Insert into MySQL

def load_data(df):


    conn = mysql.connector.connect(
        host='127.0.0.1',
        port=3306,
        user='root',
        password='*Notebook@2025',
        database='employee'
    )

    cursor = conn.cursor()
    # Create table if not exists
    cursor.execute("""CREATE TABLE IF NOT EXISTS employees(
                name VARCHAR(100),
                age INT,
                city VARCHAR(100),
                slaray DECIMAL(10,2),
                yearly_bonus DECIMAL(10,2)
    ) """)

    # Insert data row-by-row
    query="""INSERT INTO employees(name,age, city, salary, yearly_bonus) VALUES(%s, %s, %s, %s, %s) """
    for _,row in df.iterrows():
        cursor.execute(query, tuple(row))

    conn.commit()
    conn.close()

# 4Ô∏è‚É£ RUN the ETL

def run_etl(file_path):
    print("üì• Extracting data...")
    df = extract_data(file_path)
    print(df.head())

    print("üîÑ Transforming data...")
    df = transform_data(df)

    print("üíæ Loading data into MySQL...")
    load_data(df)
    
    print("‚úÖ ETL Pipeline complete.")

# Example usage in Jupyter
run_etl("data.csv")

üì• Extracting data...
      Name  Age       City  Salary
0    David   34  San Diego   79076
1  Charlie   35    Phoenix   76699
2    Quinn   38   New York   93478
3      Eve   32    Phoenix   92233
4     Paul   27    Houston   96396
üîÑ Transforming data...
üíæ Loading data into MySQL...
‚úÖ ETL Pipeline complete.

In [70]:
df.columns.tolist()

['Name', 'Age', 'City', 'Salary', 'yearly_bonus']


# 4Ô∏è‚É£ REPORT: Run analytics and export

In [3]:
import pandas as pd
import mysql.connector
from urllib.parse import quote_plus 


# 1Ô∏è‚É£ EXTRACT: Load CSV into Pandas DataFrame
def extract_data(file_path):
    df = pd.read_csv(file_path)
    return df

# 2Ô∏è‚É£ TRANSFORM: Example transformations
def transform_data(df):
    # Remove duplicate rows
    df = df.drop_duplicates()

    # Remove rows with missing names
    df = df.dropna(subset=['Name','Salary'])

    # Example: Ensure salary is numeric
    df['Salary'] = pd.to_numeric(df['Salary'], errors='coerce')

    return df

# 3Ô∏è‚É£ LOAD: Insert into MySQL

def load_data(df):


    conn = mysql.connector.connect(
        host='127.0.0.1',
        port=3306,
        user='root',
        password='*Notebook@2025',
        database='employee'
    )

    cursor = conn.cursor()    
    insert_query = """
    INSERT INTO employees (Name, Age, City, Salary)
    VALUES (%s, %s, %s, %s)
    """

    for _, row in df.iterrows():
        cursor.execute(insert_query, (
        row['Name'],
        row['Age'],
        row['City'],
        row['Salary']
        ))


    conn.commit()
    conn.close()
    print("‚úÖ Data loaded into MySQL.")


    
def export_reports():
        conn = mysql.connector.connect(
        host='127.0.0.1',
        port=3306,
        user='root',
        password='*Notebook@2025',
        database='employee'
        )

        cursor = conn.cursor()

# Example: Average salary per city
        query="""SELECT city, AVG(Salary) FROM employees 
            GROUP BY City 
            ORDER BY Salary DESC
        """
        report_df = pd.read_sql("query" )
        # report_df = pd.read_sql(query, conn)  # ‚úÖ include the connection


        # Export to CSV
        report_df.to_csv("Avg_Salary_report.csv", index=False)
        # Export to Excel
        report_df.to_excel("Avg_Salary_report.xlsx", index=False)

        conn.commit()
        conn.close()
        print("üìä Reports exported: salary_report.csv & salary_report.xlsx")

# 5Ô∏è‚É£ RUN EVERYTHING


def run_etl_with_reports(file_path):
    print("üì• Extracting data...")
    df = extract_data(file_path)
    print(df.head())

    print("üîÑ Transforming data...")
    df = transform_data(df)

    print("üíæ Loading data into MySQL...")
    load_data(df)

    print("üìä Generating reports...")
    export_reports()
    
    print("‚úÖ ETL Pipeline complete.")

run_etl_with_reports("data.csv")

üì• Extracting data...
      Name  Age       City  Salary
0    David   34  San Diego   79076
1  Charlie   35    Phoenix   76699
2    Quinn   38   New York   93478
3      Eve   32    Phoenix   92233
4     Paul   27    Houston   96396
üîÑ Transforming data...
üíæ Loading data into MySQL...
‚úÖ Data loaded into MySQL.
üìä Generating reports...

TypeError: read_sql() missing 1 required positional argument: 'con'